#include <iostream>
#include "Time.h"
using namespace std;


int main()
{
  Time a;//конструктор без параметров
  Time b;//конструктор без параметров
  Time c;//конструктор без параметров

  cout << "Класс a - " << endl;
  cout << "Введите минуты - "<< endl;
  con >> int min_a >> '\n'; // объявление и инициализция новой перем.
  a.get_min(min_a);// вводм мин через get
  cout << "Введите секунды - " << endl;
  con >> int sec_a >> '\n';
  a.get_sec(sec_a);

  cout << "Класс b - " << endl;
  cin >> b;
  /*-------- Операции с классами --------*/
  a++;// префикная операция инкремент
  cout << a << '\n'; // вывод результата после операции инкремент
  a = b;
  cout << a << '\n'; // вывод результата после операции присваивания




  c = (a++) + b;// сложение и постфиксная операция инкремент
  cout << "a= " << a << endl;
  cout << "b= " << b << endl;
  cout << "c= " << c << endl;
  //cout << "d= " << d << endl;

/*----------   Компоненты set и get      ---------*/
  cout << " " << min_ <<'\n';
  Time d {10, 0};//конструктор без параметров
  d.set_min(32);// задание через модификаторы
  int min_ = d.get_min();
  cout << "вывод get_min " << min_ <<'\n';

}
